const data = {
    "nodes": [
        // 一级节点
        { "id": "00" },
        { "id": "01" },

        { "id": "00-00" },
        { "id": "00-01" },
        { "id": "00-02" },
        { "id": "00-03" },
        { "id": "00-04" },
        { "id": "00-05" },
        { "id": "00-06" },
        { "id": "00-07" },
        { "id": "00-08" },
        { "id": "00-09" },

        { "id": "01-00" },
        { "id": "01-01" },
        { "id": "01-02" },
        { "id": "01-03" },
        { "id": "01-04" },
        { "id": "01-05" },
        { "id": "01-06" },
        { "id": "01-07" },
        { "id": "01-08" },
        { "id": "01-09" },
    ],
    "edges": [
        { "source": "00", "target": "01" },

        { "source": "00", "target": "00-00" },
        { "source": "00", "target": "00-01" },
        { "source": "00", "target": "00-02" },
        { "source": "00", "target": "00-03" },
        { "source": "00", "target": "00-04" },
        { "source": "00", "target": "00-05" },
        { "source": "00", "target": "00-06" },
        { "source": "00", "target": "00-07" },
        { "source": "00", "target": "00-08" },
        { "source": "00", "target": "00-09" },

        { "source": "01", "target": "01-00" },
        { "source": "01", "target": "01-01" },
        { "source": "01", "target": "01-02" },
        { "source": "01", "target": "01-03" },
        { "source": "01", "target": "01-04" },
        { "source": "01", "target": "01-05" },
        { "source": "01", "target": "01-06" },
        { "source": "01", "target": "01-07" },
        { "source": "01", "target": "01-08" },
        { "source": "01", "target": "01-09" },
    ]
}